In [57]:
import pandas as pd
import numpy as np
df = pd.read_csv('weight-height.csv')
df.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [58]:
import warnings
warnings.filterwarnings("ignore")

In [59]:
df.Gender = df['Gender'].replace(['Male', 'Female'], [0,1])
df.head()

   Gender     Height      Weight
0       0  73.847017  241.893563
1       0  68.781904  162.310473
2       0  74.110105  212.740856
3       0  71.730978  220.042470
4       0  69.881796  206.349801

In [60]:
df.tail()

      Gender     Height      Weight
8550       1  60.483946  110.565497
8551       1  63.423372  129.921671
8552       1  65.584057  155.942671
8553       1  67.429971  151.678405
8554       1  60.921791  131.253738

In [61]:
x = df.drop('Gender', axis=1)
x

         Height      Weight
0     73.847017  241.893563
1     68.781904  162.310473
2     74.110105  212.740856
3     71.730978  220.042470
4     69.881796  206.349801
...         ...         ...
8550  60.483946  110.565497
8551  63.423372  129.921671
8552  65.584057  155.942671
8553  67.429971  151.678405
8554  60.921791  131.253738

[8555 rows x 2 columns]

In [62]:
y = df['Gender']
y

0       0
1       0
2       0
3       0
4       0
       ..
8550    1
8551    1
8552    1
8553    1
8554    1
Name: Gender, Length: 8555, dtype: int64

In [63]:
x.shape

(8555, 2)

In [64]:
y.shape

(8555,)

In [65]:
x.head()

      Height      Weight
0  73.847017  241.893563
1  68.781904  162.310473
2  74.110105  212.740856
3  71.730978  220.042470
4  69.881796  206.349801

In [66]:
y.head()

0    0
1    0
2    0
3    0
4    0
Name: Gender, dtype: int64

In [67]:
from sklearn.model_selection import train_test_split
xtrain, xtest, ytrain, ytest = train_test_split(x, y, test_size=.30, random_state=1)

In [68]:
xtrain.head()

         Height      Weight
1277  72.385301  189.165592
5361  60.960147  124.876796
5728  69.119292  168.864403
4276  68.271050  172.941248
3112  64.991405  144.551044

In [69]:
ytrain.head()

1277    0
5361    1
5728    1
4276    0
3112    0
Name: Gender, dtype: int64

In [70]:
xtest.head()

         Height      Weight
7154  65.068038  160.800726
3258  70.824643  184.516688
2188  68.663594  184.262796
5609  65.987610  166.844114
3186  70.901461  200.466282

In [71]:
ytest.head()

7154    1
3258    0
2188    0
5609    1
3186    0
Name: Gender, dtype: int64

In [72]:
xtrain.shape

(5988, 2)

In [73]:
xtest.shape

(2567, 2)

In [74]:
ytrain.shape

(5988,)

In [75]:
ytest.shape

(2567,)

# KNN

In [76]:
from sklearn.neighbors import KNeighborsClassifier
knn = KNeighborsClassifier(n_neighbors=5)
knn.fit(xtrain, ytrain)

KNeighborsClassifier()

In [77]:
knn.score(xtest, ytest)

0.9146864043630697